Revit 2027 API
Sweep.Path3d Property
The selected curves used for the sweep path.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Path3d Path3d { get; }
Public ReadOnly Property Path3d As Path3d
	Get
public:
property Path3d^ Path3d {
	Path3d^ get ();
}
member Path3d : Path3d with get
Property Value
Path3d
Remarks
If the sweep is based on a sketched path, this property is null.
See Also
Reference
Sweep Class
Autodesk.Revit.DB Namespace